{
  "category": "paragraphs_lectures",
  "cefr_level": "C1",
  "content_type": "paragraphs",
  "items": [
    {"id": "pl_001", "text": "The Renaissance period marked a significant turning point in European history, characterized by a renewed interest in classical art, literature, and philosophy. This cultural movement, which began in Italy during the fourteenth century, gradually spread throughout the continent.", "translation_uz": "Renessans davri Yevropa tarixida muhim burilish nuqtasi bo'lib, klassik san'at, adabiyot va falsafaga yangicha qiziqish bilan ajralib turdi. XIV asrda Italiyada boshlangan bu madaniy harakat asta-sekin butun qit'aga tarqaldi.", "word_count": 40},
    {"id": "pl_002", "text": "Neuroplasticity refers to the brain's remarkable ability to reorganize itself by forming new neural connections throughout life. This discovery has revolutionized our understanding of learning, memory, and recovery from brain injuries.", "translation_uz": "Neyroplastiklik miyaning hayot davomida yangi neyron aloqalarni shakllantirib, o'zini qayta tashkil qilish qobiliyatiga ishora qiladi. Bu kashfiyot o'rganish, xotira va miya jarohatlaridan tiklanish haqidagi tushunchamizni o'zgartirdi.", "word_count": 32},
    {"id": "pl_003", "text": "Quantum mechanics, the fundamental theory in physics, describes the physical properties of nature at the scale of atoms and subatomic particles. Its principles often contradict our intuitive understanding of the macroscopic world.", "translation_uz": "Kvant mexanikasi, fizikadagi asosiy nazariya, tabiatning fizik xususiyatlarini atomlar va subatomik zarralar miqyosida tasvirlaydi. Uning tamoyillari ko'pincha makroskopik dunyo haqidagi intuitiv tushunchamizga zid keladi.", "word_count": 32},
    {"id": "pl_004", "text": "The concept of sustainable development emerged from the growing recognition that economic growth must be balanced with environmental protection. This approach aims to meet present needs without compromising the ability of future generations to meet their own needs.", "translation_uz": "Barqaror rivojlanish tushunchasi iqtisodiy o'sish atrof-muhitni muhofaza qilish bilan muvozanatda bo'lishi kerakligini tan olishdan kelib chiqdi. Ushbu yondashuv kelajak avlodlarning o'z ehtiyojlarini qondirish qobiliyatiga putur yetkazmasdan hozirgi ehtiyojlarni qondirishga qaratilgan.", "word_count": 40},
    {"id": "pl_005", "text": "Behavioral economics combines insights from psychology with economic theory to explain why people sometimes make irrational decisions. Traditional economic models assumed that humans always act rationally to maximize their utility.", "translation_uz": "Xulq-atvor iqtisodiyoti odamlar nima uchun ba'zan mantiqsiz qarorlar qabul qilishini tushuntirish uchun psixologiya tushunchalarini iqtisodiy nazariya bilan birlashtiradi. An'anaviy iqtisodiy modellar odamlar har doim o'z foydalarini maksimal darajada oshirish uchun oqilona harakat qiladi deb taxmin qilgan.", "word_count": 32},
    {"id": "pl_006", "text": "The theory of evolution by natural selection, proposed by Charles Darwin, fundamentally changed our understanding of biological diversity. It explains how species adapt to their environments over successive generations through the process of differential reproduction.", "translation_uz": "Charlz Darvin tomonidan taklif qilingan tabiiy tanlanish orqali evolyutsiya nazariyasi biologik xilma-xillik haqidagi tushunchamizni tubdan o'zgartirdi. U turlarning differensial ko'payish jarayoni orqali ketma-ket avlodlar davomida o'z muhitiga qanday moslashishini tushuntiradi.", "word_count": 35},
    {"id": "pl_007", "text": "Global migration patterns have become increasingly complex in the twenty-first century, driven by factors such as economic opportunity, political instability, and climate change. These movements of people have profound implications for both origin and destination countries.", "translation_uz": "Global migratsiya tendentsiyalari yigirma birinchi asrda iqtisodiy imkoniyatlar, siyosiy beqarorlik va iqlim o'zgarishi kabi omillar ta'sirida tobora murakkablashib bormoqda. Odamlarning bu harakatlari kelib chiqqan va borish mamlakatlari uchun chuqur oqibatlarga ega.", "word_count": 37},
    {"id": "pl_008", "text": "Artificial neural networks are computational systems inspired by biological neural networks in the human brain. These sophisticated algorithms have enabled breakthrough advances in image recognition, natural language processing, and autonomous vehicles.", "translation_uz": "Sun'iy neyron tarmoqlar inson miyasidagi biologik neyron tarmoqlardan ilhomlangan hisoblash tizimlaridir. Ushbu murakkab algoritmlar tasvirni aniqlash, tabiiy tilni qayta ishlash va avtonom transport vositalarida muhim yutuqlarga erishish imkonini berdi.", "word_count": 31},
    {"id": "pl_009", "text": "The Industrial Revolution transformed agrarian societies into industrial powerhouses, fundamentally altering social structures, working conditions, and economic systems. This period witnessed unprecedented technological innovation and urbanization.", "translation_uz": "Sanoat inqilobi agrar jamiyatlarni sanoat markazlariga aylantirdi, ijtimoiy tuzilmalar, mehnat sharoitlari va iqtisodiy tizimlarni tubdan o'zgartirdi. Bu davr misli ko'rilmagan texnologik innovatsiyalar va urbanizatsiyaga guvoh bo'ldi.", "word_count": 26},
    {"id": "pl_010", "text": "Linguistic relativity, sometimes called the Sapir-Whorf hypothesis, suggests that the structure of a language affects its speakers' worldview and cognition. This controversial theory has sparked decades of debate among linguists and cognitive scientists.", "translation_uz": "Lingvistik nisbiylik, ba'zan Sapir-Uorf gipotezasi deb ataladi, tilning tuzilishi uning sohiblarining dunyoqarashi va bilish qobiliyatiga ta'sir qilishini taklif qiladi. Bu bahsli nazariya tilshunoslar va kognitiv olimlar o'rtasida o'n yillar davomida munozaralarga sabab bo'ldi.", "word_count": 35}
  ]
}
