{
  "category": "paragraphs_debates",
  "cefr_level": "C1",
  "content_type": "paragraphs",
  "items": [
    {"id": "pd_001", "text": "While proponents of nuclear energy argue that it provides a reliable and carbon-free source of electricity, critics raise concerns about waste disposal and the risk of catastrophic accidents. The debate continues as nations seek sustainable energy solutions.", "translation_uz": "Yadro energiyasini yoqlovchilar u ishonchli va uglerod chiqindilarisiz elektr manbai ekanini ta'kidlasa, tanqidchilar chiqindilarni yo'q qilish va falokatli baxtsiz hodisalar xavfi haqida xavotirlanmoqda. Mamlakatlar barqaror energiya yechimlarini qidirayotganda munozara davom etmoqda.", "word_count": 39},
    {"id": "pd_002", "text": "The ethics of genetic engineering in humans remains a contentious topic in contemporary bioethics. Supporters point to potential medical breakthroughs, while opponents warn of unforeseen consequences and the danger of creating societal inequalities.", "translation_uz": "Insonlarda genetik muhandislikning axloqiyoti zamonaviy bioetikada bahsli mavzu bo'lib qolmoqda. Tarafdorlar potentsial tibbiy kashfiyotlarga ishora qilsa, muxoliflar oldindan ko'rmaydigan oqibatlar va ijtimoiy tengsizliklar yaratish xavfidan ogohlantirmoqda.", "word_count": 33},
    {"id": "pd_003", "text": "Universal basic income has emerged as a proposed solution to technological unemployment and economic inequality. However, skeptics question its financial feasibility and potential impact on work incentives and productivity.", "translation_uz": "Universal asosiy daromad texnologik ishsizlik va iqtisodiy tengsizlikka yechim sifatida taklif qilindi. Biroq, shubhalanuvchilar uning moliyaviy amalga oshirilishi va mehnat rag'bati hamda mahsuldorlikka ta'sirini so'roq ostiga qo'ymoqda.", "word_count": 29},
    {"id": "pd_004", "text": "The role of government surveillance in maintaining national security versus protecting individual privacy rights represents one of the most challenging dilemmas of the digital age. Both security experts and civil liberties advocates present compelling arguments.", "translation_uz": "Milliy xavfsizlikni ta'minlashda hukumat kuzatuvining roli shaxsiy maxfiylik huquqlarini himoya qilishga qarshi raqamli asrning eng qiyin dilemmasini ifodalaydi. Xavfsizlik mutaxassislari ham, fuqarolik erkinligi himoyachilari ham ishonchli dalillarni taqdim etmoqda.", "word_count": 33},
    {"id": "pd_005", "text": "The implementation of artificial intelligence in judicial decision-making processes raises fundamental questions about fairness, accountability, and the nature of justice itself. Algorithms may perpetuate existing biases present in historical data.", "translation_uz": "Sud qarorlarini qabul qilish jarayonlarida sun'iy intellektni joriy etish adolat, javobgarlik va adolatning o'zi haqida tub savollarni tug'diradi. Algoritmlar tarixiy ma'lumotlarda mavjud bo'lgan mavjud tarafkashliklarni davom ettirishi mumkin.", "word_count": 29},
    {"id": "pd_006", "text": "Critics of globalization argue that it has led to job losses in developed countries and exploitation of workers in developing nations. Advocates counter that it has lifted millions out of poverty and facilitated cultural exchange.", "translation_uz": "Globallashuv tanqidchilari bu rivojlangan mamlakatlarda ish o'rinlarini yo'qotishga va rivojlanayotgan mamlakatlarda ishchilarni ekspluatatsiya qilishga olib kelganini ta'kidlaydi. Tarafdorlar esa millionlab odamlarni qashshoqlikdan chiqarganini va madaniy almashinuvni osonlashtirgani bilan javob beradi.", "word_count": 36},
    {"id": "pd_007", "text": "The question of whether social media platforms should be held legally responsible for content posted by users remains highly contentious. Freedom of speech considerations must be balanced against the spread of misinformation and harmful content.", "translation_uz": "Ijtimoiy media platformalari foydalanuvchilar tomonidan joylashtirilgan kontent uchun qonuniy javobgar bo'lishi kerakmi degan savol juda bahsli bo'lib qolmoqda. So'z erkinligi mulohazalari noto'g'ri ma'lumotlar va zararli kontentning tarqalishi bilan muvozanatlanishi kerak.", "word_count": 33},
    {"id": "pd_008", "text": "Proponents of space exploration emphasize its potential for scientific discovery and the long-term survival of humanity. Critics argue that the enormous financial resources could be better allocated to addressing urgent problems on Earth.", "translation_uz": "Kosmosni o'rganish tarafdorlari uning ilmiy kashfiyotlar va insoniyatning uzoq muddatli omon qolishi uchun salohiyatini ta'kidlaydi. Tanqidchilar ulkan moliyaviy resurslarni Yerdagi shoshilinch muammolarni hal qilishga yaxshiroq yo'naltirish mumkinligini ta'kidlaydi.", "word_count": 33}
  ]
}
