{
  "category": "paragraphs_literature",
  "cefr_level": "C2",
  "content_type": "paragraphs",
  "items": [
    {"id": "plt_001", "text": "The modernist literary movement challenged conventional narrative structures and experimented with stream of consciousness techniques. Joyce's intricate prose and Woolf's psychological depth exemplify the era's preoccupation with subjective experience and the fragmentation of identity.", "translation_uz": "Modernist adabiy harakat an'anaviy hikoya tuzilmalariga qarshi chiqdi va ong oqimi texnikalarini sinab ko'rdi. Joysning murakkab nasri va Vulfning psixologik chuqurligi davrning sub'ektiv tajriba va identitetning parchalanishi bilan band bo'lganligini namoyish etadi.", "word_count": 36},
    {"id": "plt_002", "text": "Shakespeare's tragedies explore the inexorable consequences of human ambition, jealousy, and moral transgression. The playwright's nuanced characterization and sophisticated use of dramatic irony continue to resonate with contemporary audiences across cultural boundaries.", "translation_uz": "Shekspirning fojialari insoniy ambitsiya, rashk va axloqiy buzilishning muqarrar oqibatlarini o'rganadi. Dramaturgning nozik obraz yaratishi va dramatik ironiyadan mohirona foydalanishi madaniy chegaralar bo'ylab zamonaviy tomoshabinlar uchun hamon ahamiyatli.", "word_count": 32},
    {"id": "plt_003", "text": "Dostoevsky's psychological novels penetrate the depths of human consciousness with unprecedented intensity. His protagonists grapple with existential questions of guilt, redemption, and the nature of moral responsibility in a world seemingly devoid of divine order.", "translation_uz": "Dostoyevskiyning psixologik romanlari inson ongining chuqurliklariga misli ko'rilmagan kuchlilik bilan kirib boradi. Uning qahramonlari ilohiy tartibdan mahrum ko'rinadigan dunyoda aybdorlik, xalos bo'lish va axloqiy javobgarlikning ekzistensial savollari bilan kurashadi.", "word_count": 36},
    {"id": "plt_004", "text": "The postmodern condition is characterized by skepticism toward metanarratives and an embrace of plurality, fragmentation, and indeterminacy. Authors such as Borges and Calvino playfully subvert readers' expectations through self-referential texts and labyrinthine narrative structures.", "translation_uz": "Postmodern holat metanarrativlarga shubha va ko'pchilik, parchalanish va noaniqlikni qabul qilish bilan tavsiflanadi. Borxes va Kalvino kabi mualliflar o'z-o'ziga havola qiluvchi matnlar va labirint hikoya tuzilmalari orqali o'quvchilar kutganlari bilan o'ynoqi ravishda kurashadi.", "word_count": 36},
    {"id": "plt_005", "text": "Romantic poetry celebrated the sublime power of nature and the primacy of individual emotion over rationalist constraints. Wordsworth's contemplative verses and Byron's passionate exuberance embody divergent strains within the movement's rich tapestry.", "translation_uz": "Romantik she'riyat tabiatning ulug'vor kuchini va ratsionalist cheklovlar ustidan individual his-tuyg'ularning ustunligini ulug'ladi. Vordsvortning mulohazali she'rlari va Bayronning ishtiyoqli g'ayrativarligi harakat boy to'qumasidagi turli yo'nalishlarni mujassam etadi.", "word_count": 32},
    {"id": "plt_006", "text": "Kafka's enigmatic narratives articulate the alienation and absurdity characteristic of modern existence. His protagonists find themselves trapped in labyrinthine bureaucratic systems, unable to comprehend the arbitrary rules governing their increasingly precarious situations.", "translation_uz": "Kafkaning jumboqli hikoyalari zamonaviy mavjudlikning begonalashish va absurdligini ifodalaydi. Uning qahramonlari o'zlarini labirint byurokratik tizimlarida tutqun holda, tobora beqaror vaziyatlarini boshqaruvchi o'zboshimchalik qoidalarini tushuna olmaydi.", "word_count": 31},
    {"id": "plt_007", "text": "The Latin American literary boom introduced magical realism as a distinctive narrative mode that seamlessly integrated fantastical elements into realistic settings. Garcia Marquez's sweeping family sagas epitomize this synthesis of the mundane and the marvelous.", "translation_uz": "Lotin Amerika adabiy portlashi sehrli realizmni fantastik elementlarni realistik muhitga muammosiz integratsiyalashgan o'ziga xos hikoya uslubi sifatida taqdim etdi. Garsiya Markesning keng oilaviy dostonlari kundalik va mo''jizaviyning bu sintezini namoyish etadi.", "word_count": 35},
    {"id": "plt_008", "text": "Virginia Woolf's experimental novels reject conventional plot structures in favor of exploring the interior lives of her characters. Her innovative narrative techniques capture the fluid nature of consciousness and the ephemeral quality of human perception.", "translation_uz": "Virjiniya Vulfning eksperimental romanlari an'anaviy syujet tuzilmalarini rad etib, o'z qahramonlarining ichki hayotini o'rganishni afzal ko'radi. Uning innovatsion hikoya texnikalari ongning suyuq tabiatini va inson idrokining vaqtinchalik sifatini aks ettiradi.", "word_count": 33}
  ]
}
