{
  "category": "paragraphs_medium",
  "cefr_level": "B2",
  "content_type": "paragraphs",
  "items": [
    {"id": "pm_001", "text": "The internet has revolutionized the way we communicate and access information. People can now connect with others around the world instantly.", "translation_uz": "Internet biz muloqot qilish va ma'lumotlarga kirish usulimizni o'zgartirdi. Endi odamlar dunyo bo'ylab boshqalar bilan bir zumda bog'lanishi mumkin.", "word_count": 23},
    {"id": "pm_002", "text": "Climate change is one of the most pressing issues of our time. Rising temperatures are causing polar ice caps to melt and sea levels to rise.", "translation_uz": "Iqlim o'zgarishi zamonimizning eng dolzarb muammolaridan biridir. Haroratning ko'tarilishi qutb muzliklarining erishi va dengiz sathining ko'tarilishiga olib kelmoqda.", "word_count": 27},
    {"id": "pm_003", "text": "Regular physical exercise has been proven to improve both mental and physical health. Even thirty minutes of walking each day can make a significant difference.", "translation_uz": "Muntazam jismoniy mashqlar ruhiy va jismoniy salomatlikni yaxshilashi isbotlangan. Kuniga o'ttiz daqiqa piyoda yurish ham sezilarli farq qilishi mumkin.", "word_count": 25},
    {"id": "pm_004", "text": "Education is the foundation of personal and societal development. It empowers individuals to make informed decisions and contribute positively to their communities.", "translation_uz": "Ta'lim shaxsiy va ijtimoiy rivojlanishning asosidir. U insonlarga ongli qarorlar qabul qilish va jamiyatlariga ijobiy hissa qo'shish imkoniyatini beradi.", "word_count": 22},
    {"id": "pm_005", "text": "Artificial intelligence is transforming various industries from healthcare to transportation. While it offers many benefits, it also raises ethical concerns that need to be addressed.", "translation_uz": "Sun'iy intellekt sog'liqni saqlashdan transportgacha turli sohalarni o'zgartirmoqda. U ko'p foydalar taklif qilsada, hal qilinishi kerak bo'lgan axloqiy muammolarni ham keltirib chiqaradi.", "word_count": 26},
    {"id": "pm_006", "text": "Sustainable living practices are becoming increasingly important in our modern world. Simple changes like reducing plastic use and conserving energy can have a positive environmental impact.", "translation_uz": "Barqaror yashash amaliyotlari zamonaviy dunyomizda tobora muhim bo'lib bormoqda. Plastik ishlatishni kamaytirish va energiyani tejash kabi oddiy o'zgarishlar atrof-muhitga ijobiy ta'sir ko'rsatishi mumkin.", "word_count": 26},
    {"id": "pm_007", "text": "The globalization of trade has created both opportunities and challenges for economies worldwide. Countries must adapt their policies to remain competitive in the international market.", "translation_uz": "Savdoning globallashuvi butun dunyo iqtisodiyotlari uchun imkoniyatlar ham, qiyinchiliklar ham yaratdi. Mamlakatlar xalqaro bozorda raqobatbardosh bo'lib qolish uchun siyosatlarini moslashtirishi kerak.", "word_count": 24},
    {"id": "pm_008", "text": "Mental health awareness has grown significantly in recent years. More people are seeking help for psychological issues, and the stigma surrounding mental illness is gradually decreasing.", "translation_uz": "Ruhiy salomatlik to'g'risida xabardorlik so'nggi yillarda sezilarli darajada oshdi. Ko'proq odamlar psixologik muammolar uchun yordam so'ramoqda va ruhiy kasallik atrofidagi stigma asta-sekin kamaymoqda.", "word_count": 27},
    {"id": "pm_009", "text": "Renewable energy sources like solar and wind power are becoming more affordable and efficient. Many governments are investing heavily in these technologies to reduce carbon emissions.", "translation_uz": "Quyosh va shamol energiyasi kabi qayta tiklanadigan energiya manbalari yanada arzon va samarali bo'lib bormoqda. Ko'pgina hukumatlar uglerod chiqindilarini kamaytirish uchun bu texnologiyalarga katta sarmoya kiritmoqda.", "word_count": 27},
    {"id": "pm_010", "text": "Cultural diversity enriches societies by bringing different perspectives and traditions together. Learning about other cultures promotes understanding and reduces prejudice between communities.", "translation_uz": "Madaniy xilma-xillik turli nuqtai nazarlar va an'analarni birlashtirish orqali jamiyatlarni boyitadi. Boshqa madaniyatlar haqida o'rganish tushunishni rivojlantiradi va jamoalar o'rtasidagi xurofotni kamaytiradi.", "word_count": 22}
  ]
}
